# 字典练习  对级别为1的员工 工资加薪1000 级别加1
test_dict = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}

print(f"加薪前的字典为{test_dict}")

# 遍历字典
for x in test_dict:
    if test_dict[x]["级别"] == 1:
        test_dict[x]["级别"] += 1
        test_dict[x]["工资"] += 1000

print(f"加薪后的字典为{test_dict}")
